# LegendShowConfigurationName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialFieldManager..::..LegendShowConfigurationName Property
SpatialFieldManager Class See Also
---
If true legend contains analysis configuration name.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool LegendShowConfigurationName { get; set; }
```

Visual Basic
---
```text
Public Property LegendShowConfigurationName As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool LegendShowConfigurationName {
	bool get ();
	void set (bool value);
}
```

# See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace